AccumulationRegisters/БалансВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>БалансВодителей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Деньги</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/БалансВодителей/Ext/ManagerModule.bsl
Функция ПолучитьБаланс() Экспорт
	БалансВодителей = РегистрыНакопления.БалансВодителей;
	Фильтр = Новый Структура;
	Фильтр.Вставить("Водитель", ПользователиИнформационнойБазы.ТекущийПользователь().Имя);  
	Если БалансВодителей.Остатки(, Фильтр).Количество() = 0
	Тогда Возврат 0;
	Иначе Возврат БалансВодителей.Остатки(, Фильтр).ВыгрузитьКолонку("Деньги")[0];
	КонецЕсли;
КонецФункции
